{
  "entries": [
    {
      "date": "Sept 3nd, 2024",
      "content": "Just a few fixes today. \n I started out by cleaning up some of the capitalizations of the AWS Services. I think it looks better now. \n\nI also added a footer where someone can change the font of the entire site. Not sure how interesting that is, but it does certainly give the whole page a more interactive feeling. That being said, most of the other work was focused on CSS. I wanted to actually find a way to transition from font to font in like a morphing kind of way, but as far as I can tell there really is no good way to do that. Oh well. \n\n Thats all for today. Give the font picker a try!\n -MG"
    },
    {
      "date": "Sept 2nd, 2024",
      "content": "I spent most of the day working on various parts of the contact and resume pages. Specifically, I focused heavily on the css for the contact page so the individual soial media links looked cohesive and matched the icons and color schemes of the actualy networks. \n\n It one of my last merged PRs to the main branch, I accidentally changed the css for the <h2> blocks on the resume page to be a light shade of gray which probed unreadable. \n I had to fix that. \n\n Also I added on a section for my specific areas of focus I have had in the 'summary of skills' section. I am still on the fence over the font. I really do like this 8-Bit stily font, but I do think it does look a bit unprofessional. I may look into changing it back to something like Helveitca, bit it does make the site feel a whole lot more bland that way. \n\n Anyway its almost 1AM and I think I can stop working for now. \nUpdates to come. \n -MG \n\n P.S. I am adding some filler text below to fill the page. Its another CSS thing >:("
    },
    {
      "date": ">>> Just Some Bee Movie Filler Text <<<",
      "content": "According to all known laws of aviation, there is no way a bee should be able to fly. Its wings are too small to get its fat little body off the ground. The bee, of course, flies anyway because bees don't care what humans think is impossible. \n\n Yellow, black. Yellow, black. Yellow, black. Yellow, black. Ooh, black and yellow! Let's shake it up a little. \n\n Barry! Breakfast is ready! Coming! Hang on a second. Hello? - Barry? - Adam? - Can you believe this is happening? - I can't. I'll pick you up. Looking sharp. Use the stairs. Your father paid good money for those. Sorry. I'm excited. \n\n Here's the graduate. We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. - You got lint on your fuzz. - Ow! That's me! - Wave to us! We'll be in row 118,000. - Bye! Barry, I told you, stop flying in the house! - \n\nHey, Adam. - Hey, Barry. - Is that fuzz gel? - A little. Special day, graduation. Never thought I'd make it. Three days grade school, three days high school. Those were awkward. Three days college. I'm glad I took a day and hitchhiked around the hive. You did come back different."
    }
  ]
}
